// Все задания подразумевают использоание Set/Map/деструктуризации или комбинаций из них.

// ----

// 1. создайте функцию получающую массив и возвращающая новый без дубликатов.



// 2. создайте функцию, принимающую строку и возвращающую bool:
//   - true - если строка палиндром
//   - false - если нет


// 3. создайте функцию, принимающую любое кол-во чисел и возвращающую Map, в котором
// ключи и значения это переданные числа в функцию, по принципу возрастания. Числа 
// будут по цепочке ссылаться на следюущее число по старшенству.

// Пример:

//   f(6,3,44,1,9) -> Map { 1 -> 3, 3 -> 6, 6 -> 9, 9 -> 44 } 

  
const task1 = () => {

}

task1();